---
kind: method
id: M:Autodesk.Revit.DB.AdaptiveComponentInstanceUtils.HasAdaptiveFamilySymbol(Autodesk.Revit.DB.FamilyInstance)
source: html/31a84012-d4b7-69a0-13e5-b77501312b07.htm
---
# Autodesk.Revit.DB.AdaptiveComponentInstanceUtils.HasAdaptiveFamilySymbol Method

Verifies if a FamilyInstance has an Adaptive Family Symbol.

## Syntax (C#)
```csharp
public static bool HasAdaptiveFamilySymbol(
	FamilyInstance famInst
)
```

## Parameters
- **famInst** (`Autodesk.Revit.DB.FamilyInstance`) - The FamilyInstance

## Returns
True if the FamilyInstance has an Adaptive Family Symbol.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null